Revit 2027 API
RebarSplice.SourceRebarEnd Property
 Identifies the end of the source rebar which is part of this rebar splice - 0 for start, 1 for end. The source rebar is the one from which this rebar splice was obtained.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SourceRebarEnd { get; }
Public ReadOnly Property SourceRebarEnd As Integer
	Get
public:
property int SourceRebarEnd {
	int get ();
}
member SourceRebarEnd : int with get
Property Value
Int32
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace